[
  {
    "chunk": 1,
    "text": " this and actually this was this was uh this option was after we discussed this option because it would be much cheaper than hiring i always told you at that time also that it's not going to be cheaper as hiring it's just going to be that we like when we have cold periods we don't have uh somewhere on our payroll number 60k per month for for boc no no no per month how 60. we're talking about 20k but one guy yeah yes yes so three months so you need him for three months that's 60k uh that's three months yes yes Yes, but how about Hamad? We can hire him for $6,000, and we can give him a location for traveling and this would be much cheaper. And we have him for 10 months. Yeah. Hamad, so the thing is, yeah, I mean, how are we going to get someone like that? Then, of course, there's a lot of, you know, management. I'm just saying that maybe the price is a bit too much. Because I know that even in Saudi Arabia you would find much less, any people, lesser cost if you went through that way. Yes, because now you're, why we said that we go through in Pakistan? Because we thought it's cheaper. at 8.5 k for uh for an engineer coming from pakistan and we will cover all the costs you know his traveling cost uh visa housing and such and business visa is expensive with with the insurance and all that of course we have to look at those prices also so why should why we should do that bring someone from pakistan while it's not cheaper and we can we can we have a lot of companies in saudi arabia that can do this for free i mean maybe you can find someone who's a freelancer and he cannot he can do it if we go let's we have let's have this assumption if we go with hudaipa will be much cheaper if you go with hudayfa would be much cheaper uh to be honest we have to have to check with him and see any because i told you it one and a half months of work but i i saying that you talking about 60k for two projects yeah for the automation one one of them is a boc then you are paying 50 percent of the boc cost okay if we are talking about the amount that's okay more than 50 percent is almost all the boc costs for for one guy oh it doesn't make sense so so the thing is this okay the the thing is this what what what i was i was speaking to hamad about this yesterday and what he was saying is that we have we have input this into the cost of the project but this is what we have done but anyway hamad He didn't do it in the BOC. No, it's 35K, right, BOC? The BOC is 35K, and you need this guy for one and a half months in EBC, and that's almost 30K. Yes, yes, if you add this. But, Ayman, this is the... You have a lot of work. You have your work going there, coming back. 100 so Ahmad give me your give us your side and what do you think about it what because see at the end of the day we have to get this done you like it or not yes but but but i don't think these guys are a good option because i believe that we have cheaper option in Saudi Arabia why would i go and bring someone from Pakistan that have a very high value i mean I can bring someone here. I don't have to give him travel. I don't have to give him visa, insurance. I don't care about this. He already has his diploma and he can do the work and he can come back. I mean, we can hire two guys. One is based in Dammam and one based in Jeddah. And that's it. From two different companies, we can do it. And it will be much cheaper also for us. There is the thing of cost and Hamad give us give us your side and what what do you think about this and because we need to come to conclusion on this. Right. It's I think is right. If we have option of hiding two resources in two different cities and they are available somehow inshallah So then this is very cheap seriously You're talking about one guy and you imagine this one guy there one city Four months is 20k Let's assume that we have we have a long project. Let's let's say ABC then and then SCADA system. Right? Let's assume this. So you have two months with ABC and then three months with the SCADA system. How much is this? 20K and you add up for 500, that's 100K. I rather hire a guy. You know, I rather hire a guy instead of being 20K for nothing. Honestly, like if they cover, if, okay, if I tell them, okay, 8K and they cover everything, transportation. I don't care. I give him 80k you finish the job and you bring it to me. Okay, no problem. But it's care for them alone and they have their own margins and then I pay for all of his expenses for one month. It doesn't make sense. And I don't think anyone would agree on such idea honestly. that you're your one one operator that costs 5k or one technician that cost 5k would be 15k. Doesn't it? So what I will what I can do now in Shallah. Uh I can send them back an email. There are two options. Either we go for the discount. Or we say 8k 8500 is fine but everything else you will cover travel residence everything if they do this okay with me if they cover everything okay but if I give him eight and a half K and also I pay for everything you know this is okay I will send an email and let's see what they say no problem great otherwise inshallah the guys that we hire for the remote sites within those cities where our sites are inshallah this is a good good option I know some of the guys who used to work for this sublime Mambouru we used with Honeywell for example let me give you something I had one guy was working with me he only took the company paid for him around the 9k And that it And he an engineer He in Saudi and he goes he based in so he works there. He comes to our office. His cost is 9k. That's it. He was direct Heidi of. He was not that hiring of Honeywell. He was some supplementary from a different company. So yeah, yeah, that's supplementary from a different company was taking something else from Honeywell and they were giving him only 9K. So maybe they give him say I know they give him 6K. They give him 6K or maybe 5 and 5 and something like this. I know about this but I'm talking about from our perspective like anyway for example we made 9K but what I'm saying that if we compare this with the uh poltronic uh proposal this is too much too much so i'm sure i know i will talk on the same lines which you are demanding and they let's see what they come up with also and if they don't agree and honestly if they don't agree and i really believe it's much much better if you find the supply company in the mom and supply company in jibda so they don't say to us you cover everything plus he's based in your city he doesn't know what he's based on your city that's it so i mean we we need we need so this is this is one of the major reasons for why uh yeah even we spoke yesterday and we know that this is not very very like i mean it's expensive but we also need to find out the alternatives so who's going to find out about these companies i i don't know much about it okay i i will do this uh with marifa we will look for companies we will contact them and then we will set up a meeting with them together yes and how and do you want do you want hama to give uh uh i'm not sure we will contact them we will tell them that we want some month project details and number of the guys we want and so on or so So Ahmad will join us for the meeting and he gave them the brief. Okay. Okay. Now, Ahmad, for now, just keep, I'm not saying don't save to Poltronic. No. Go back to them. Tell them that, well, this is the reality of things. It doesn't make sense for us as a company to pay you 20K for your housing and your housing.",
    "duration": 599.879
  },
  {
    "chunk": 2,
    "text": " and so on like for like it doesn't really i pay for housing i bet for food transportation tickets yes and uh and uh i give them also eight games and and also for so even anyone we get so for supervising them and i mean it should be someone who is a a little experienced engineer this is important because we cannot be be me or how many people are you planning to bring for let's say ABC in case two one only one one be moving one but but then he will be moving to Jetta one engineer one engineer the other one for example from Saudi Arabia we can get a technician or something like that to help him out with the cabling if there's a need but uh of course uh as a it's also the same why from pakistan we get one from south arabia we get two that's because of the fact that you know when it comes to ultronic there's it's not only about uh the engineer itself that you know all the drawings all all the things that is needed actually their back office will have will be doing that it's not just the engineer's case this is something that we spoke about plus of course they are under the project like their project management would be they would be on a daily basis also going back to our tronic like we do we are not you know continuously have to be on their backs for this so this was also part of what it is but prices are high I understand but the boss is too much seriously no problem yeah we will go back to them and let's see and also tell us about the companies who are supplying the expectation you need these guys so that's what I would this that's another part of this yeah we have them a lot after Ramadan so if we start in Ramadan I don't know if it's like we're gonna be we're not sure if when those finish their work but this is an issue because they're still working so let's say finish at the beginning of ramadan do we start in ramadan itself or how should we do this we have erp work also that needs to be done this can be done parallely it not that it cannot be done parallely but how should we do it uh should we have a discussion with much yeah for this three machines for for hammer can you can you go yourself and do it maybe take for us with you I of course think yeah I mean it's not something that is this thing with MES involved with all the stuff involved I don't think that that's a smart idea it's a lot of work it's not just to keep this as a fallback it's a lot of work element and i know it's not uh uh what is it how many dry contacts are you creating you're taking four points per machine um uh how many exactly do you have we have we decided that this is some stuff we have to decide on exactly how to take the contact or where to put certain things but what's the exact number ah Ahmad if you can give me exact number is uh there are three machines in balama so exact number is 20 to 25 signals we need from the no no no three machines at least but if we go with full i mean all alarms everything then you can say 30 signals from one machine so 30 signal it is not as much as you think actually the only issue is uh uh in balhamar i would not say issue uh we need a little experience resource there resource there who who has done some work in aftermarket support also who are for in the brownfield projects we we as iot solutions are demanding a brownfield guy not a greenfield guy so what this brownfield guy will do he will go to the site he will work in existing machines and he knows how to get the dry signals there from there and he's not actually learning from us all the time because we we yeah you know this right so we know the requirement for the actually guy uh what what kind of skill set he must have all right send me send me the requirement the scope yeah the skills he needs okay yeah let me look in brother for available courses here yeah Yeah, definitely, definitely. Your side, speak to Fultron. Tell them that this is so much. Your price is fine, but you will cover everything. You can tell them, you can tell them. If, for example, your project management is very expensive, we don't need project management. We will manage it If this is like I need something that they are an excuse from their side Yeah But you need to tell them that It doesn make sense Saudi Arabia, it's very expensive. And if we are going to, I don't care if you give him 50 rial per day or give him 10 rial per day. It's up to you when you're employee. Okay. But I cannot bring him in and I give him our quarters. So you and the price shoots up to more than 15. It doesn't make sense. Okay, I will be for the fallback that even is discussing. For example, I have not worked with France for the actually technical executions. I I don't know how he's in there. Do you think he would be able to cover the ME stuff? because it will be a little tricky he has to program in uh you want flexi also yeah i mean if if he's trained step by step he can but the problem is he himself cannot do it no it has to be someone with him some engineer with him and then inshallah at least the first project for sure and um yeah yeah that that is philosophy's position he will not even lead it himself no. Tayyip, Khanas, listen for now let's do this. We can't think of many other fallbacks later on. For now, speak to Fultronic, tell them that it's very expensive for us. I mean we don't really care about the 8.5k, it's fine. But the problem is that you give us everything that we are responsible for. It doesn't make sense for us. So they will be responsible for the food of the resource? They are responsible for everything. What about visa also? Transportation. Everything. Business visa, right? Yeah. Business visa, work visa, whatever. They come from. Tourist visa. Anything. Okay, no issue. I'll inshallah write back. It doesn't matter for me as long as the resource is here. I'm going to be here. No, no. We will go to jail. Oh, it's hashtag. Okay, good. But what I saying is that this is I mean they should have done something like this before And they know how to extract Jesus so it not not new to them hmm Saudi Arabia itself I believe is something new to them This is something from what we understood because they don't have an office in in Saudi Arabia or anything like that. But but but they have a CR in Saudi Arabia. No, no, no, no, no CR in Saudi Arabia. I think that this is our position and it's up to them. Good, good, totally fine. If they say okay, okay. If they say no, we'll find something else in short. Yeah. So, to take action points, I will look for other companies that can provide engineers of technicians in Saudi Arabia one basically one best one best in the pump sorry and one best in Jeddah from your side check with Photronic and think about a fallback plan if we didn't find something in Saudi Arabia and those guys are very expensive but probably we will find it so director it's not that good yep inshallah so so yeah so this is this is the the reason for the meeting is even if even if this is not what we go for but we have to really take this seriously and search yanni we have been waiting uh you know not been doing this so inshallah we search we make sure and then we we decide on something okay okay uh one last thing for the for the resources in two different cities uh i i would i'm just a little bit uh worried about it because it will be in the topping extra resources on top of each other so better if we get only one resource and then we move around and then we add when we need okay we will see we will see which is cheaper and convenient and that's cheaper like which which has a better quality and convenient for all for us one resource from one company for three months or one resource from from two companies and for one and a half or two months okay we'll see how it goes and have different options great I think it's fine okay also yesterday I had a discussion with Amr",
    "duration": 599.919
  },
  {
    "chunk": 3,
    "text": " Since we are here, both of you, I had a discussion regarding the loss of print-to-back. We lost print-to-back. Yes. And I believe that print-to-back proposal had so many mistakes from the beginning. Different prices, an inconsistent number of machines, many, many issues. But the main thing that I think me and Amr talked about is that we need to sell something with the expectation of the company. Customer. Yes. Or the client. Because what Amr told me, I'm not sure. I don't know. You guys have visited Brentaparte, I think. No, I never visited Brentaparte. Amr visited. So Amr and Amr visited. Yes. Okay, so when they visited, they maybe had a lack of communication because I believe, correct me if I'm wrong, but there was a mistake in the proposal somewhere. Like you caught it first high and then you changed the number of machines. They said that Target Reach gave them 25 machines and we gave them five, something like this, right? Did you see the proposal of Target Reach? I did see the proposal. So they quoted 100 K for OE for the software side only. You saw that, right? Yeah. So now I think now what we can. I'm not sure if this is visible, but let's think about it. I already had a meeting with the arm before. One week back on. Wait, let me, let me, I met Amro yesterday. Okay. Ah, okay. Okay. So again, since we had this discussion before that I don't, I am not very convinced of the pricing structure that we have. Okay. It might work now, but it does not really, it doesn't, for me, it doesn't make sense. Okay. So maybe, and this is an idea. Okay. Maybe we can and shift from number of machine Currently we have number of machine structural pricing Yeah Do module based pricing So if a company wants OE we can give them OE alone as monitoring with this price If they want scheduling, we will give them scheduling at this price. Yes. And go on and it doesn't matter the number of machines here. Okay, which is, I believe it's more feasible and might prevent us from losing very easy projects like that. Okay, Ahmad, anything to say? So, first of all, my issue with that sort of thinking, which I think makes sense when you look at it from a business perspective, or when you look at it from an engineering perspective, now, we just discussed, and this is one of the major reasons for this meeting today, is we just discussed the price of getting one machine connected. And we have three machines in Balhamar. And according to what we gave you, a real-world example, of course, I agree, and me and Hamad, we're both with you on this, that it's expensive. Now, I still don't know, neither does Hamad, neither do you, know exactly how much it's going to cost for one machine, even for Balhamar, until we actually do the project. then we understand how much connecting three machine does not i don't think it will take a time of one month before i mean there are the amount of work that we have there when you go and see just for the engineer to come there and understand the circuit itself it's going to take a long time even if me and hamad go there it's going to take time you have to sit down with those engineers understand remember you're working you're we are working with a machine that's already in production you move a wire you make any mistake see anyone who makes three machines you you're talking about we are going to do for 55 machines how much is that no no no no so look the problem is this the first machine see we are over here we are doing new hardware and we're doing new software we have to get our our our side connected plus that side connected so the first machine is what takes extra time the other two machines will be less inshallah will be less and that's where a conflict other other these are not same yes okay let's say 10 machines are the same then 10 machines are different and 10 machines are different and then five machines are different right yes there are yeah and this is the reality uh on the shop floor uh These in the production they will never give us downtime Whenever we need it, they will say we will give you downtime for after three days, for example. And. Our resource will not moving around all the time, right? So he will be there when he's needed, for example. This is one issue. The second issue is reading the. current circuit diagram of the panel and getting the exact signal and then he will program the HMI also and then he will program the flexi also. OK OK, but if this is the case, if I bring one resource and I pay for his daily active daily consumption. OK, whatever you think, yeah, if I if I'm going if I'm gonna pay for everything it isn't that feasible if we hire I can I can bring this engineer with one of course now at around let's say 15 K and I give him every month okay and that's it this is what I mean that's really good that's good but the problem is it is a very respectable and it's perfect. Then yes, and now we have two projects. These guys from E1 might come and then we will have more projects to come. So it actually makes more sense to hire than actually, you know, going with this subcontent. No problem. No problem. Better if we can get a resource for that. Okay. Okay. So let's evaluate all options. Okay. now check for subcons. Ahmad, you already told me there is one guy for implementation before, right? Yeah, his name is and he's currently getting 15,000 from the Akisa. How much? 15,000. His name is and he's also following up too much. 15,000 is too much. Yeah, and currently he's earning. I think He has four years experience in Saudi. In Saudi, but in Pakistan he has more experience. Maybe we can bring someone from there You know Pakistan India Sri Lanka whatever I really believe that we can have people from Saudi Arabia with lower salary that we can involve like From any other country if we bring it will be Very costly. I think within Saudi Arabia if we can find it. He must have a car for them. He To move around Yeah, let's Let's do let's do this. Okay. Let's for now do everything that parallel Okay, yeah, it was an open position and the real account LinkedIn maybe some of the people you know Okay And I will look for other companies. I had if you know someone also this boss and Maybe I will go so strongly that we need what they call it automation engineer with us okay and let's see all options let's see all options and if we have like some guy that come with us at full time like onboarding with us with a very low not very low let's say within 10k salary it will be much better for us yeah if we can get a guy who is at 10k i think it will be it will be good but the thing is this the guy he has to be so the thing that is expected right now from him i don't know if we'll be able to get someone at that salary but we should try anyway you can bring him at the center and you can have a clear interview i mean remember these stuff all take time me and hamad are like even for me it you know you know you know you know head hunting is extremely extremely hard you have to judge so many things you have to have time to have interviews that's not saying head hunting i'm saying bring bring me the cv i will filter and i will put them filter again and for the technical interview you lead it yeah yeah no issues if it's the interview that needs to be led it's okay but it's always the extra stuff that is that that that takes more time you know emailing that is okay preparing that's all that if i will email everything we will do here okay me and marifa you just worry about the technical details and bring me some people inshallah i'll see if i have you have free options okay talk to fortronic to actually",
    "duration": 599.892
  },
  {
    "chunk": 4,
    "text": " make this reasonable one to find another subcon subcontractor uh provider who who are available or higher directly yes this is our options from the beginning okay um this is this is a possibility in shall i'll try to get what i can from my side inshallah i'll see if i have and hama too but inshallah i hope you guys or you also will be looking for them um and then first so anyway getting back to our topic with with actually actually Amr was also talking to me yesterday about it I said look go and I agree that the pack is a loss so he was saying that I don't know you know if like how is the pricing structure is it okay is it not okay I said look to be honest with you there's a lot of things that we need to find out still because our main major issue now is the number of machines what changes when it comes to the amount of work that we have to do it's the number of machines wait wait wait yes go ahead our issue for the software is not the number of machine no it is the number of machines because you are your issue with the software wait no it is the number of machines because our issue with the software okay our issue with the The license will run on one machine and 100 machines. There is nothing changed on the software side of things. Ahmed, that does not matter. It's just customization. Ahmed, that does not matter. That does not matter. What matters is your full solution. Your full solution is not the software. Your full solution is the implementation with the software. That's the hardest part of the MES. Writing software. So if you increase the number of machines, that means we have to increase the number of implementation unless someone else takes implementation out of our hands. Because that is where, so software is staying stable. We agree with you. Plus, whatever happens, software is disprice. It doesn't matter. You give me 100 machines, I just have to increase the number of databases, and it will be fine, inshallah. The issue that we have is, how are we going to connect the machines? That's where our expense is. And that's what you can say. Okay, okay, okay. Which is actually a separate cost structure. It a separate cost structure I am not telling you change the pricing of project implementation I am saying change the pricing of software licenses To what Implementation if you have five machines this is the cost If you have 10 machines this is the cost. If you have 100 machines, this is the cost. Software license will be the same. If you want to have one OE engine, this is the cost. You want to run it on one machine or 100 machines, it's up to you. Yeah, that's more not how it's working right now. no it's not how it's working you are you are linking your license with implementation cost yeah but we we have no choice but to do so because the license let me tell you something you you have a 10 20 license um uh 20 machine license that's around 300 k and you will put implementation cost of 20 machines it doesn't make sense you need no agreed agreed with you but the thing is this whenever whenever see whatever happens the cost will be the same because just because we increase the cost with the license that that was how we're doing it before but from the way it's not the same because because ahmad when he created the proposal he created the implementation cost separate from the machine from the uh license cost yes yes but whatever If I sell the license at 50k for Balhamar, will I be profitable? If you sell the licenses at... Currently now, at the structure we built, the license for Balhamar, how much? 350 or around 300 and 80. Yeah, something like that. If I sell it at 100k, will I be profitable? Because we have margins on implementation, we have margins on hardware. So my point is not I meant what happens now what needs to go for implementation part of that we're also putting from what I understand is also part of what we're increasing in software. No, we need that part. No, we have to. have to if this is not the way this is not the way the proposal is built you are much in extra yeah yeah just uh okay uh the previous proposals that we had uh in the in the last meeting when we had on thursday i think two weeks back inshallah we had the meeting I already said Amr that if there is a customer he wants OE We will sell them OE, no problem. Okay. And this OE as a module, we will sell. So module-based pricing is different stuff. And that idea came when we actually finished the OE module, right? and we had the use case of printopack also. So I think that idea resonates now that AMR wants to have a separate pricing model for each module. but the problem is that for for full-fledged mes even if we sell full-fledged mes for let's say 50 machines and we say if it is for 100k i don't have any issue i mean we have the software we need to put the margins over it it is there now it's now no problem whatever price we need to finalize we should finalize but we need to do it quickly because we need to call to customer customer we have to prepare proposals for next i think three customers uh two amro is actually i think he is visiting uh one yeah so so it's not about finalizing and let's add it now says Adil now says that your current pricing of the software is have within it the price of implementation. No, no, no. If this is the case, Adil, I would not add a price for implementation. Why would I add a price? No, I agree. When it comes to Hamad's one, yes, we're a printer pack. i'm not sure but for the stuff that we are doing with the skada and all that's how we do it where uh it's all mixed up together but yeah okay if you are completely right you have your license price alone and then you have your implementation price at all yeah but when you when you have to make that we we count the license based on machine and then we You also count the license based on the limitation So you are doubling up on the price That why we lost bring to back If we have this pricing model, like let's say bring to back come and we say we only want OE. And let's assume we give them OE at 50K or 100K, whatever the price. Okay. And we say this is the implementation cost. This will be around 250. We would have won the project. instead of 400 and something because you are adding two over each other. This is why from the first meeting we had in the center I told you I am not very convinced about this price because it does not look like it's it's it doesn't make sense because if you have 50 machines that's around 600k if you have 51 machines that around 400k it is you know it the price doesn't make sense and And if you are right about implementation within the product, the price should not go down with the number of machines increased. Yeah, this is something Ayman spoke about when he visited the center also. Remember when we have that very rigid structure. That I agree with. That one is something we have to do. But printer pack, just because it's five machines, the thing is when it comes to printer pack itself, I do not think our price would go lower would it is the question because why why it wouldn't go I don't have uh let me check uh because even the machines so machines also are different the printer pack machines are huge machines you know they are not like it's not uh dry signals only over there it would be sky it would be uh sql databases we really do not even know exactly how to connect uh and this is one of the things this is again another problem you need to uh fix the people the business development whether it's for us or amro who goes there and then he gave you the info you need to make it standardized what is the info that actually needs to collect so this is yeah go ahead because if you want to create something wait this is our proposal",
    "duration": 599.919
  },
  {
    "chunk": 5,
    "text": " If it's not consistent, you will have inconsistent process like Brentu back. I don't remember if it is Brentu back, but I remember there was proposal that. I want to pricing for five machine was way more than the price of the competitor. OK, no problem. Can you go to the pricing or pricing down there? Down. Yeah. OK. OK. all right so so the just just talk about the software right now and then we will talk about the other stuff the price for the software for only and you see there are a lot of options given we are giving manufacturing execution we are giving oe we are giving production reports we are giving planning and scheduling they only need oe right they only think that we are giving them one second this this is another thing that needs to be what do they need so when they were very very clear from the first day they were very very clear to amro that all we need is monitoring we i want to be able to monitor oe is something that we said this is which is which is what he wants in some way shape or form but he did not he didn't care about quality per se so he is not so he really wants availability and performance and he told amro this very very clear and amro told us also and then you add you added manufacturing execution yeah because reporting you are planning and which is fine which is i i'm guys i'm not saying that this is a mistake uh we blame each other this is a learning opportunity exactly no see i spoke to me i told him go to a man sit down and then i will call a meeting with me and hamad and that's exactly because we we need to come to conclusions on this and at the end even this meeting may not be enough but yeah we're learning so go ahead yeah yeah so my point my point is like okay we have this we have a nice pricing and again i'm not sure about the problem of number of machines but this is our price and you see you have this this one here 140k you see it here this is our our implementation post this is this is your implementation bus that you bought and this is your software and this is the hardware related to the software. Okay, let's look at the other component. Okay. So they did not even say anything much about okay i need to we need to do this as project costs they they embedded it in their software and that it so they came up with this 360k so around 70k the issue the issue is at that time we discussed and this time we discussed when it comes to these people i like it's very hard to understand what they're doing for integration aren't they actually it doesn't matter for them what to do because there's an expense you are not you are not in a position i'm sorry i'm talking about the capitals okay you are not in a position okay to fix other people infrastructure 100 okay we are we we don't have the luxury to tell them that we only we're gonna do it but we're only gonna do it right It does not make sense. Okay? For them, the company, they are not stupid. Print to back is not stupid. They saw this solution as something that's very valuable. Maybe they don't need an ARB integration as part of this. Okay? They don't want to have an ARB integration. They just want to monitor their running time of their machine status. Is it running? Is it off? What is my availability score? What is my performance score? That was the only thing they care about. I think this is an issue of evaluation also. This is again, I told you before, you need to make a stand up for everyone who goes to evaluate the site, which tell you exactly what they want. It's not like they assume that they want everything. And this is again a problem I really think that every one of us have. The problem of trying to give the client the best they like, you know, what they call it, man's blading or whatever you call that, you know, man's blading, man's blading. Okay. Like you are wrong. I am right. This is the correct architecture. You have to do it. You have to do it in UNS. You have to have availability. You have to have this type of connection. You have to connect to the ERP. But then, and again, and I'm pretty sure this is, Amro did a great job, but he had this concept in his mind. Okay, the client wants an IMAs. I want to build him the best infrastructure that supports IMAs. No the client did not ask for this The client said I want monitoring only Monitoring only if we go back to our proposal okay which is this one Half of it is not there. Like half of this will be deleted. What is the total price of our proposal? So we are at 440, they are at 380. 360. Yeah, and look at look at this. This is a ridiculous price. They are selling their IOT gateway at 14. What is the IOT gateway is for him? Go up. Maybe what did they do? Adding sensors and you know. Their pricing is all mixed and they are not divided it properly. Yeah, so it is the quantity for our gateways, right? right then he says five additional sensors so so the thing is that my my point my point that i want you to focus on okay that especially because hamad you are you are the technical support in creating proposals okay you need to tell the guys who evaluate a project before we send the proposal that okay what do you need take their need exactly as is and build the proposal based on their need maybe in the meeting when we meet them with them we can discuss of potential improvement but i don't give him a proposal a ridiculous high price proposal because i am assuming that the infrastructure i am proposing is the best infrastructure for them no see but even then we have to customize the software for everyone according to their need no you don't customize the software for everyone in general you have basically you have metrics your modules is metrics it is actually the one you are selling oee oee scheduling scheduling manufacturing execution manufacturing excuse we have to then yeah disabled all the stuff i don't know the software yep yep yeah no and and so for me when it comes to evaluation why is it it, you know, a very challenging part is, let's say we're talking, I'm talking about southbound connections, that means connecting to the plant floor. I to be honest with you I don even know how do you do this evaluation properly Like for example to understand can we connect to the PLC or not So for that we have to carry with us You know, I did it for one factory, which is Arak Plastic. And it was like it was so hard and absolute at the end of the day, a waste of time because no one knew anything. They didn't even know the IP addresses. You start with the assumption that everyone need to get to an sensors. No, no, no, no, no. We need we need data on the machine. okay they say that like like printer pack like printer pack for example they say we need machines and the um and the stuff that they were asking when it comes to the data they want is crazy and you cannot do that through sensors amru was explaining it and even it comes to the colors every time it switches he wants to know i'm like unless you connect unless you connect the sql data yeah yeah there is a problem with follow-up there is a problem with follow-up if amru explained and they have a ridiculous pricing, they follow up with them, okay? They produce the scope with them, and they set up on the pricing. We did not follow up with them. We did not discuss with them. We did not make it clear. We just visited, evaluated, sent the proposal, and sent it to them. And what is the follow-up? What happened to the proposal? What happened to the proposal? Are you agreeing on this proposal? That is our follow-up. We did not sit with them as a technical follow-up. Why we propose this? What is the idea that... Did they ask for any discounts, Simon? Huh? Did they ask for any discounts? They did not ask for anything because there was no actual discussion with them. They saw a proposal and we kept following for them to close the proposal. But we did not discuss with them why we are building, why our proposal looks like this and why we have this. I believe that there was some explanation going on between that major issue is that look, five machines, these guys are giving us for 360 and for five machines, we are giving them a 400. So this was there. I mean, for them, there was no discussion there, you know, because it's then we can sit with them again and explain and understand. Okay, we evaluated wrong. We have this. It's fine. And this is the problem. The evaluation, the proposal, as I said, created for five machines and then 25 machines with a lesser license. Which in reality, which in reality, I believe that we are maybe the cheapest.",
    "duration": 599.919
  },
  {
    "chunk": 6,
    "text": " So how come it's a problem of actually promoting it's not a problem of pricing in its essence but it's for how we propose based on the ask based on the requirement. so yeah okay actually uh even that uh there is all there are always also situations when you when the supplier of technology they say we just need to sell it whatever price we are selling it so target reach did not put any engineering management pricing right any project management pricing they and we they i'm sorry but you really don't know okay you don't know what is the software they are selling they are selling a 20k license per one year you don't know maybe they created this this is a this is a this is a bloated price and this customer has to understand that because every year he will pay right number one did we said with the customer and discuss with them the difference between our proposal and them. This is an issue because we have to follow up constantly. We have to follow up. But I think we cannot discuss proposals like that with other because they gave us. How come the guy gave us the proposal? We can't sit with them. We discuss blindly like we did with Bilhamah. Bilhamah They did not know that we have the proposals but we had the proposal of our competitors but we discussed blindly. We tell them in general what other proposal might look like. Yep. You know, and again, guys, this is a very important lesson learned for us, very important. And it should resonate to us, from me, business side, from you as a technical support, and also development, and for Amr and for us. that once we send the proposal, if there is not a good sentiment from the client, we sit with them, we discuss with them technically. Okay, let's understand. Is this part of the things that you want? How we can fix this? How we can make the proposal to liking stuff like this? I think we did not do any meetings with the with you even meet to the guy No no I never meet we never meet We never meet even Yeah this is a problem This is the problem Honestly, I mean, this is a huge problem. If there was a chance to sit with them, then we maybe would be able to. Sorry, but the sales team has to create this chance. They can't request a meeting. They can't. We send them a proposal. They can call them and they can say, okay, let's sit together and discuss this proposal. proposal. Okay. Yeah, good. Good. Very good point because Aviva how they sell it when they send the proposal and they schedule the meetings to explain the proposal. This is what we have given. This is you want to remove this focus or we will remove it. So I was looking at the prices for modules are giving manufacturing execution OEE production planning and scheduling and production reports. Right? So there are three modules. If I divide 150 divided by three, let's suppose one module is 50 000 let's suppose for five machines so the price 100k would be minus from our price and if i minus 150k uh 100k it would be one 330 and same price as what they have provided uh other target reach yeah absolutely we have to sit i mean if if customers are serious which was He was a serious customer and he wanted to have a solution. So the very next immediate step after sending the proposal is that, sir, I want to explain my proposal to you. So when can we say, just tell us. There is also another thing that Amru was very clear with what they wanted. But then we had our MES and we offered that. So maybe we have to find a way where we only offer what they ask for. So we, yeah. So this is also important because he was very clear. I mean, this guy was very clear. He said, I don't want anything. I just want this. And I'm told us a number of times also. So yeah, we need to align more with exactly what the customer wants. And then we can offer other stuff too. But if they accept any. So anyway, I think it's a lesson that we. Okay. So this is a so let's let's finalize. So we have the technician or automation engineer. We have three options, as I said, discuss with Fultronic, make them make the price reasonable. We try to find different companies based in Saudi Arabia or we hire directly Okay these are three options The other part is that from your side is to really think about how we are going to price software And this is very important. And the last part, Adil, we really need to now it's now it's more than any time because before we would not have only one project. But now we really need to activate Todoist. Activate everyone who does not use Todoist. Okay. Like I will make a big role. Like everyone who does not communicate through email and Todoist, maybe I will issue warnings for them. Because we cannot continue working with this chaos. We cannot do it. Yes. We cannot do it. Like I listen from Amr and then I listen from you. then i listen from whatever and everyone have their own like bubble they are working on it doesn't make sense yeah so anyways yeah right now it's it's uh it's important that we we see it's not that to do is not being used we use it for normal tasks now for above the management of of items of like different projects no so for example i have different projects with uh with the Kiswah, with Doha, which we put tasks, all of us, once we have meetings, we put tasks, we do follow-up. We need to monitor every task, we need to monitor the deadline of every task, every task has a deadline and everything. I already sent you a structure to do this, and let's implement this, and I'm pretty sure, like if everyone was forced to do it, they will get the habit of doing it yep yep no it's something that you know we have spoken a lot of times but again we have always but before we we were not at this stage of different projects before we only had one project everyone was in the same place so it's fine but now no okay we have two different projects or four different projects you have a doha you have you have a Kiswa, you have and maybe Ewa is coming in. So we know and more than that, we also have new projects coming up, you know always proposals and this and that And you have BOC with Kako you have a visit with this second company from intake today i have two visits and i got to know yesterday night a lot okay it's good this is good problems to have and it it it it will make us more structure more structures let's everyone be responsible and fill the information that they need so any other action points I missed no I think I think from my side I believe everything is covered anything I'm not no I think all is fine okay I'm one I'm worried about most I mean this automation engineer thing we need we need to we need to so so the the second part which is finding about companies in Saudi Arabia. Inshallah, you will be looking for them. Hamad, please don't forget that we need to prepare what do we expect in the engineer? What is his role? Give him the role of work, the experience needed, and so on. Give me this so I can talk to other companies. I tell them, listen, I want someone with this experience who have worked with this before and whatever. yeah and and then the issue is you know with us we cannot just say one plc it has to be they have to like because you know we go to different different so yeah so just please uh also give that to me so that inshallah i can also try to search in in my groups of course back in sri lanka i don't i don't know anyone because i lived here all my life so if you can post something within your network it has yes it's very important yes yes i will actually if we know because in two weeks once they are over i know that this balhamar guys you know they will just start pushing like crazy for us to come and start doing the work even if it's ramadan so we have to find ways on what we do and at what time but we have to be ready in shock So one last thing. Yeah. As we were discussing yesterday, maybe until 18th of February, the hardware and cable laying network readiness will be 100% OK from Palama. Then they will try to push us. Bring your resource, start the work.",
    "duration": 599.892
  },
  {
    "chunk": 7,
    "text": " connect your connect the hardware. Yes, in parallel, we will be doing other stuff. So in Ramadan, what is your opinion in China? To for the work? So do we need to our on site engineers in Ramadan on site or they will be on site after Ramadan? We were thinking that way we have to do this. Okay, if they push for us, we have to do it because remember the The BOC is linked to our contract. Yes. Yes, we have to get it done. We have to get it done for us as soon as possible, because the contract is 50% down payment. Yes. So once we finish the BOC and we approve everything, they give us $400K immediately. Yeah, that's really true. Yes. So it's in our position to finish tomorrow, even. I not Roman It our best interest honestly Both of you know the problem we have with cash flow yeah much money are coming to the bank as possible yes yes yep so we cannot we cannot wait through through ramadan that's for sure um so yeah let's let's work on this so that inshallah we can again get this out of the out of the way inshallah if you have someone good class big headache. Let me look at these companies and we will find out a solution. But listen, guys, very important that we need to finalize the thing about pricing. So tell us, Ahmad, the module base, how fast we can do that and how we can price this based on module architecture. and how does that fix the price okay we know that this price for this license this much and we have an estimate price for their machine for implementation that it okay What I will do I will sit with Amr today today inshallah And then with Amr and Amr and Adil together and think about something. And let's meet on it tomorrow. Okay. Inshallah. Okay. We have the, how about tomorrow we have meeting APC, right? Most probably. Yes. Yes. Yes. We have that. Okay. So, inshallah, Saturday, I will be in the... Maybe Saturday and Sunday. I'm not sure about Sunday. You are going to do the visit for the new factory? Or who's going? No, that one will be most probably Amru, which is on Monday. But let's see. Okay. So, now Amru will be there on Monday. Please, now, as a new action point, create standard for evaluation. Please not I sent already I sent already. Alhamdulillah Yeah Carlos Okay Then if you send it already Carlos This is the standard store evaluation for us This is how we will The information that we collect Day before yesterday 11 PM I and Amro had meeting. He was at the airport and I explained him about the document. How he would evaluate the site because he had to go to for serious assessment. He want to use that document for evaluation for mes uh for the roadmap for the future for the customers good very good already i shared on the email also i shared on the whatsapp also for amr also i sent uh our adil and amro also absent promise yes great great thank you guys thank you thank you very much Thank you.",
    "duration": 252.001999999
  }
]